Revit 2027 API
FailureDefinition.GetApplicableResolutionTypes Method
 Retrieves a list of resolution types applicable to the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FailureResolutionType> GetApplicableResolutionTypes()
Public Function GetApplicableResolutionTypes As IList(Of FailureResolutionType)
public:
IList<FailureResolutionType>^ GetApplicableResolutionTypes()
member GetApplicableResolutionTypes : unit -> IList<FailureResolutionType>
Return Value
IList<FailureResolutionType>
 The list of resolution types applicable to the failure.
See Also
Reference
FailureDefinition Class
Autodesk.Revit.DB Namespace